app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands"
---
  def index
    @brands = Brand.all

SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @brand = Brand.find(params[:id])

SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @brand = Brand.where("id = '#{params[:id]}'")

INSERT INTO "brands" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 08 Apr 2013 22:14:55 UTC +00:00], ["name", "Audi"], ["updated_at", Mon, 08 Apr 2013 22:14:55 UTC +00:00]]
---
  def create
    @brand = Brand.new(params[:brand])

    respond_to do |format|
      if @brand.save