app/controllers/vehicles_controller.rb

  def index
    @vehicles = Vehicle.all
---
SELECT "vehicles".* FROM "vehicles"

  def show
    @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "4"]]

  def create
    @vehicle = Vehicle.new(params[:vehicle])

    respond_to do |format|
      if @vehicle.save
---
INSERT INTO "vehicles" ("brand_id", "created_at", "customer_id", "name", "updated_at", "vehicle_type_id") VALUES (?, ?, ?, ?, ?, ?)  [["brand_id", nil], ["created_at", Mon, 15 Apr 2013 21:49:04 UTC +00:00], ["customer_id", nil], ["name", nil], ["updated_at", Mon, 15 Apr 2013 21:49:04 UTC +00:00], ["vehicle_type_id", nil]]

  def update
    @vehicle = Vehicle.find(params[:id])

    respond_to do |format|
      if @vehicle.update_attributes(params[:vehicle])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "vehicles" SET "price" = 150000.0, "kilimeters_covered" = 200000, "fuel_type" = 'Nafta', "year" = 2010, "updated_at" = '2013-05-20 21:36:12.579595' WHERE "vehicles"."id" = 4

  def destroy
    @vehicle = Vehicle.find(params[:id])
    @vehicle.destroy
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 1]]